modm-ext/data.modm.io/docs/svd/header_stm32u3b5xx.svd
        <register>
          <name>SECBB1R8</name>
          <description>FLASH secure block-based bank 1 register 8</description>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEC0</name>
              <description>Page 96 in bank 1 block-based secure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC1</name>
              <description>Page 97 in bank 1 block-based secure</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC2</name>
              <description>Page 98 in bank 1 block-based secure</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC3</name>
              <description>Page 99 in bank 1 block-based secure</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC4</name>
              <description>Page 100 in bank 1 block-based secure</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC5</name>
              <description>Page 101 in bank 1 block-based secure</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC6</name>
              <description>Page 102 in bank 1 block-based secure</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC7</name>
              <description>Page 103 in bank 1 block-based secure</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC8</name>
              <description>Page 104 in bank 1 block-based secure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC9</name>
              <description>Page 105 in bank 1 block-based secure</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC10</name>
              <description>Page 106 in bank 1 block-based secure</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC11</name>
              <description>Page 107 in bank 1 block-based secure</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC12</name>
              <description>Page 108 in bank 1 block-based secure</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC13</name>
              <description>Page 109 in bank 1 block-based secure</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC14</name>
              <description>Page 110 in bank 1 block-based secure</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC15</name>
              <description>Page 111 in bank 1 block-based secure</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC16</name>
              <description>Page 112 in bank 1 block-based secure</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC17</name>
              <description>Page 113 in bank 1 block-based secure</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC18</name>
              <description>Page 114 in bank 1 block-based secure</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC19</name>
              <description>Page 115 in bank 1 block-based secure</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC20</name>
              <description>Page 116 in bank 1 block-based secure</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC21</name>
              <description>Page 117 in bank 1 block-based secure</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC22</name>
              <description>Page 118 in bank 1 block-based secure</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC23</name>
              <description>Page 119 in bank 1 block-based secure</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC24</name>
              <description>Page 120 in bank 1 block-based secure</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC25</name>
              <description>Page 121 in bank 1 block-based secure</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC26</name>
              <description>Page 122 in bank 1 block-based secure</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC27</name>
              <description>Page 123 in bank 1 block-based secure</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC28</name>
              <description>Page 124 in bank 1 block-based secure</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC29</name>
              <description>Page 125 in bank 1 block-based secure</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC30</name>
              <description>Page 126 in bank 1 block-based secure</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC31</name>
              <description>Page 127 in bank 1 block-based secure</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECBB2R1</name>
          <description>FLASH secure block-based bank 2 register 1</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEC0</name>
              <description>Page 0 in bank 2 block-based secure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC1</name>
              <description>Page 1 in bank 2 block-based secure</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC2</name>
              <description>Page 2 in bank 2 block-based secure</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC3</name>
              <description>Page 3 in bank 2 block-based secure</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC4</name>
              <description>Page 4 in bank 2 block-based secure</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC5</name>
              <description>Page 5 in bank 2 block-based secure</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC6</name>
              <description>Page 6 in bank 2 block-based secure</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC7</name>
              <description>Page 7 in bank 2 block-based secure</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC8</name>
              <description>Page 8 in bank 2 block-based secure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC9</name>
              <description>Page 9 in bank 2 block-based secure</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC10</name>
              <description>Page 10 in bank 2 block-based secure</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC11</name>
              <description>Page 11 in bank 2 block-based secure</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC12</name>
              <description>Page 12 in bank 2 block-based secure</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC13</name>
              <description>Page 13 in bank 2 block-based secure</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC14</name>
              <description>Page 14 in bank 2 block-based secure</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC15</name>
              <description>Page 15 in bank 2 block-based secure</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC16</name>
              <description>Page 16 in bank 2 block-based secure</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC17</name>
              <description>Page 17 in bank 2 block-based secure</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC18</name>
              <description>Page 18 in bank 2 block-based secure</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC19</name>
              <description>Page 19 in bank 2 block-based secure</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC20</name>
              <description>Page 20 in bank 2 block-based secure</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC21</name>
              <description>Page 21 in bank 2 block-based secure</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC22</name>
              <description>Page 22 in bank 2 block-based secure</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC23</name>
              <description>Page 23 in bank 2 block-based secure</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC24</name>
              <description>Page 24 in bank 2 block-based secure</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC25</name>
              <description>Page 25 in bank 2 block-based secure</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC26</name>
              <description>Page 26 in bank 2 block-based secure</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC27</name>
              <description>Page 27 in bank 2 block-based secure</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC28</name>
              <description>Page 28 in bank 2 block-based secure</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC29</name>
              <description>Page 29 in bank 2 block-based secure</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC30</name>
              <description>Page 30 in bank 2 block-based secure</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC31</name>
              <description>Page 31 in bank 2 block-based secure</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECBB2R2</name>
          <description>FLASH secure block-based bank 2 register 2</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEC0</name>
              <description>Page 32 in bank 2 block-based secure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC1</name>
              <description>Page 33 in bank 2 block-based secure</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC2</name>
              <description>Page 34 in bank 2 block-based secure</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC3</name>
              <description>Page 35 in bank 2 block-based secure</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC4</name>
              <description>Page 36 in bank 2 block-based secure</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC5</name>
              <description>Page 37 in bank 2 block-based secure</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC6</name>
              <description>Page 38 in bank 2 block-based secure</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC7</name>
              <description>Page 39 in bank 2 block-based secure</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC8</name>
              <description>Page 40 in bank 2 block-based secure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC9</name>
              <description>Page 41 in bank 2 block-based secure</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC10</name>
              <description>Page 42 in bank 2 block-based secure</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC11</name>
              <description>Page 43 in bank 2 block-based secure</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC12</name>
              <description>Page 44 in bank 2 block-based secure</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC13</name>
              <description>Page 45 in bank 2 block-based secure</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC14</name>
              <description>Page 46 in bank 2 block-based secure</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC15</name>
              <description>Page 47 in bank 2 block-based secure</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC16</name>
              <description>Page 48 in bank 2 block-based secure</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC17</name>
              <description>Page 49 in bank 2 block-based secure</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC18</name>
              <description>Page 50 in bank 2 block-based secure</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC19</name>
              <description>Page 51 in bank 2 block-based secure</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC20</name>
              <description>Page 52 in bank 2 block-based secure</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC21</name>
              <description>Page 53 in bank 2 block-based secure</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC22</name>
              <description>Page 54 in bank 2 block-based secure</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC23</name>
              <description>Page 55 in bank 2 block-based secure</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC24</name>
              <description>Page 56 in bank 2 block-based secure</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC25</name>
              <description>Page 57 in bank 2 block-based secure</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC26</name>
              <description>Page 58 in bank 2 block-based secure</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC27</name>
              <description>Page 59 in bank 2 block-based secure</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC28</name>
              <description>Page 60 in bank 2 block-based secure</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC29</name>
              <description>Page 61 in bank 2 block-based secure</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC30</name>
              <description>Page 62 in bank 2 block-based secure</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC31</name>
              <description>Page 63 in bank 2 block-based secure</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
