modm-ext/data.modm.io/docs/svd/header_stm32u3b5xx.svd
        <register>
          <name>PRIVBB2R4</name>
          <description>FLASH privilege block-based bank 2 register 4</description>
          <addressOffset>0xfc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRIV0</name>
              <description>Page 96 in bank 2 block-based privilege</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV1</name>
              <description>Page 97 in bank 2 block-based privilege</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV2</name>
              <description>Page 98 in bank 2 block-based privilege</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV3</name>
              <description>Page 99 in bank 2 block-based privilege</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV4</name>
              <description>Page 100 in bank 2 block-based privilege</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV5</name>
              <description>Page 101 in bank 2 block-based privilege</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV6</name>
              <description>Page 102 in bank 2 block-based privilege</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV7</name>
              <description>Page 103 in bank 2 block-based privilege</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV8</name>
              <description>Page 104 in bank 2 block-based privilege</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV9</name>
              <description>Page 105 in bank 2 block-based privilege</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV10</name>
              <description>Page 106 in bank 2 block-based privilege</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV11</name>
              <description>Page 107 in bank 2 block-based privilege</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV12</name>
              <description>Page 108 in bank 2 block-based privilege</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV13</name>
              <description>Page 109 in bank 2 block-based privilege</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV14</name>
              <description>Page 110 in bank 2 block-based privilege</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV15</name>
              <description>Page 111 in bank 2 block-based privilege</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV16</name>
              <description>Page 112 in bank 2 block-based privilege</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV17</name>
              <description>Page 113 in bank 2 block-based privilege</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV18</name>
              <description>Page 114 in bank 2 block-based privilege</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV19</name>
              <description>Page 115 in bank 2 block-based privilege</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV20</name>
              <description>Page 116 in bank 2 block-based privilege</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV21</name>
              <description>Page 117 in bank 2 block-based privilege</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV22</name>
              <description>Page 118 in bank 2 block-based privilege</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV23</name>
              <description>Page 119 in bank 2 block-based privilege</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV24</name>
              <description>Page 120 in bank 2 block-based privilege</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV25</name>
              <description>Page 121 in bank 2 block-based privilege</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV26</name>
              <description>Page 122 in bank 2 block-based privilege</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV27</name>
              <description>Page 123 in bank 2 block-based privilege</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV28</name>
              <description>Page 124 in bank 2 block-based privilege</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV29</name>
              <description>Page 125 in bank 2 block-based privilege</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV30</name>
              <description>Page 126 in bank 2 block-based privilege</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV31</name>
              <description>Page 127 in bank 2 block-based privilege</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVBB2R5</name>
          <description>FLASH privilege block-based bank 2 register 5</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRIV0</name>
              <description>Page 0 in bank 2 block-based privilege</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV1</name>
              <description>Page 1 in bank 2 block-based privilege</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV2</name>
              <description>Page 2 in bank 2 block-based privilege</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV3</name>
              <description>Page 3 in bank 2 block-based privilege</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV4</name>
              <description>Page 4 in bank 2 block-based privilege</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV5</name>
              <description>Page 5 in bank 2 block-based privilege</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV6</name>
              <description>Page 6 in bank 2 block-based privilege</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV7</name>
              <description>Page 7 in bank 2 block-based privilege</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV8</name>
              <description>Page 8 in bank 2 block-based privilege</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV9</name>
              <description>Page 9 in bank 2 block-based privilege</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV10</name>
              <description>Page 10 in bank 2 block-based privilege</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV11</name>
              <description>Page 11 in bank 2 block-based privilege</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV12</name>
              <description>Page 12 in bank 2 block-based privilege</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV13</name>
              <description>Page 13 in bank 2 block-based privilege</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV14</name>
              <description>Page 14 in bank 2 block-based privilege</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV15</name>
              <description>Page 15 in bank 2 block-based privilege</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV16</name>
              <description>Page 16 in bank 2 block-based privilege</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV17</name>
              <description>Page 17 in bank 2 block-based privilege</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV18</name>
              <description>Page 18 in bank 2 block-based privilege</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV19</name>
              <description>Page 19 in bank 2 block-based privilege</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV20</name>
              <description>Page 20 in bank 2 block-based privilege</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV21</name>
              <description>Page 21 in bank 2 block-based privilege</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV22</name>
              <description>Page 22 in bank 2 block-based privilege</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV23</name>
              <description>Page 23 in bank 2 block-based privilege</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV24</name>
              <description>Page 24 in bank 2 block-based privilege</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV25</name>
              <description>Page 25 in bank 2 block-based privilege</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV26</name>
              <description>Page 26 in bank 2 block-based privilege</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV27</name>
              <description>Page 27 in bank 2 block-based privilege</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV28</name>
              <description>Page 28 in bank 2 block-based privilege</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV29</name>
              <description>Page 29 in bank 2 block-based privilege</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV30</name>
              <description>Page 30 in bank 2 block-based privilege</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV31</name>
              <description>Page 31 in bank 2 block-based privilege</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVBB2R6</name>
          <description>FLASH privilege block-based bank 2 register 6</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRIV0</name>
              <description>Page 0 in bank 2 block-based privilege</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV1</name>
              <description>Page 1 in bank 2 block-based privilege</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV2</name>
              <description>Page 2 in bank 2 block-based privilege</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV3</name>
              <description>Page 3 in bank 2 block-based privilege</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV4</name>
              <description>Page 4 in bank 2 block-based privilege</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV5</name>
              <description>Page 5 in bank 2 block-based privilege</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV6</name>
              <description>Page 6 in bank 2 block-based privilege</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV7</name>
              <description>Page 7 in bank 2 block-based privilege</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV8</name>
              <description>Page 8 in bank 2 block-based privilege</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV9</name>
              <description>Page 9 in bank 2 block-based privilege</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV10</name>
              <description>Page 10 in bank 2 block-based privilege</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV11</name>
              <description>Page 11 in bank 2 block-based privilege</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV12</name>
              <description>Page 12 in bank 2 block-based privilege</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV13</name>
              <description>Page 13 in bank 2 block-based privilege</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV14</name>
              <description>Page 14 in bank 2 block-based privilege</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV15</name>
              <description>Page 15 in bank 2 block-based privilege</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV16</name>
              <description>Page 16 in bank 2 block-based privilege</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV17</name>
              <description>Page 17 in bank 2 block-based privilege</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV18</name>
              <description>Page 18 in bank 2 block-based privilege</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV19</name>
              <description>Page 19 in bank 2 block-based privilege</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV20</name>
              <description>Page 20 in bank 2 block-based privilege</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV21</name>
              <description>Page 21 in bank 2 block-based privilege</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV22</name>
              <description>Page 22 in bank 2 block-based privilege</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV23</name>
              <description>Page 23 in bank 2 block-based privilege</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV24</name>
              <description>Page 24 in bank 2 block-based privilege</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV25</name>
              <description>Page 25 in bank 2 block-based privilege</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV26</name>
              <description>Page 26 in bank 2 block-based privilege</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV27</name>
              <description>Page 27 in bank 2 block-based privilege</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV28</name>
              <description>Page 28 in bank 2 block-based privilege</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV29</name>
              <description>Page 29 in bank 2 block-based privilege</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV30</name>
              <description>Page 30 in bank 2 block-based privilege</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV31</name>
              <description>Page 31 in bank 2 block-based privilege</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
