modm-ext/data.modm.io/docs/svd/header_stm32u3b5xx.svd
        <register>
          <name>EVTSRC1R</name>
          <description>HSP Event source register 1</description>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVT9SRC</name>
              <description>EVT9SRC[2:0] bits (Event source selection for priority encoder input 9)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT10SRC</name>
              <description>EVT10SRC[2:0] bits (Event source selection for priority encoder input 10)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT11SRC</name>
              <description>EVT11SRC[2:0] bits (Event source selection for priority encoder input 11)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT12SRC</name>
              <description>EVT12SRC[2:0] bits (Event source selection for priority encoder input 12)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT13SRC</name>
              <description>EVT13SRC[2:0] bits (Event source selection for priority encoder input 13)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT14SRC</name>
              <description>EVT14SRC[2:0] bits (Event source selection for priority encoder input 14)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT15SRC</name>
              <description>EVT15SRC[2:0] bits (Event source selection for priority encoder input 15)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT16SRC</name>
              <description>EVT16SRC[2:0] bits (Event source selection for priority encoder input 16)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTSRC2R</name>
          <description>HSP Event source register 2</description>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVT17SRC</name>
              <description>EVT17SRC[2:0] bits (Event source selection for priority encoder input 17)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT18SRC</name>
              <description>EVT18SRC[2:0] bits (Event source selection for priority encoder input 18)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT19SRC</name>
              <description>EVT19SRC[2:0] bits (Event source selection for priority encoder input 19)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT20SRC</name>
              <description>EVT20SRC[2:0] bits (Event source selection for priority encoder input 20)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT21SRC</name>
              <description>EVT21SRC[2:0] bits (Event source selection for priority encoder input 21)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EVT22SRC</name>
              <description>EVT22SRC[2:0] bits (Event source selection for priority encoder input 22)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFCFGR</name>
          <description>HSP BUFF configuration register</description>
          <addressOffset>0xf4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUFF0DIR</name>
              <description>BUFF0DIR (Direction selection of BUFF0 &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUFF1DIR</name>
              <description>BUFF1DIR (Direction selection of BUFF1 &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUFF2DIR</name>
              <description>BUFF2DIR (Direction selection of BUFF2 &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUFF3DIR</name>
              <description>BUFF3DIR (Direction selection of BUFF3 &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2FEN</name>
              <description>I2FEN (integer to float32 conversion &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMB0</name>
              <description>COMB0 (BUFCMB control for buff_evt[0] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMB1</name>
              <description>COMB1 (BUFCMB control for buff_evt[1] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMB2</name>
              <description>COMB2 (BUFCMB control for buff_evt[2] )</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFDR0</name>
          <description>HSP BUFF data register array</description>
          <addressOffset>0xf8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUFFDAT</name>
              <description>BUFFDAT[31:0] bits (Data buffer)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFDR1</name>
          <description>HSP BUFF data register array</description>
          <addressOffset>0xfc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUFFDAT</name>
              <description>BUFFDAT[31:0] bits (Data buffer)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFDR2</name>
          <description>HSP BUFF data register array</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUFFDAT</name>
              <description>BUFFDAT[31:0] bits (Data buffer)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFDR3</name>
          <description>HSP BUFF data register array</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUFFDAT</name>
              <description>BUFFDAT[31:0] bits (Data buffer)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGINCFGR</name>
          <description>HSP TRGIN configuration register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRG0POL</name>
              <description>TRG0POL (Polarity selection for TRGIN0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1POL</name>
              <description>TRG1POL (Polarity selection for TRGIN1)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG2POL</name>
              <description>TRG2POL (Polarity selection for TRGIN2)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG3POL</name>
              <description>TRG3POL (Polarity selection for TRGIN3)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG4POL</name>
              <description>TRG4POL (Polarity selection for TRGIN4)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG5POL</name>
              <description>TRG5POL (Polarity selection for TRGIN5)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG6POL</name>
              <description>TRG6POL (Polarity selection for TRGIN6)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG7POL</name>
              <description>TRG7POL (Polarity selection for TRGIN7)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG8POL</name>
              <description>TRG8POL (Polarity selection for TRGIN8)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG9POL</name>
              <description>TRG9POL (Polarity selection for TRGIN9)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFGR</name>
          <description>HSP TRGO configuration register</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRGO0SRC</name>
              <description>TRGO0SRC[1:0] bits (Trigger source selection for hsp_trg_out[0] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRGO1SRC</name>
              <description>TRGO1SRC[1:0] bits (Trigger source selection for hsp_trg_out[1] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRGO2SRC</name>
              <description>TRGO2SRC[1:0] bits (Trigger source selection for hsp_trg_out[2] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRGO3SRC</name>
              <description>TRGO3SRC[1:0] bits (Trigger source selection for hsp_trg_out[3] )</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSEGR</name>
          <description>HSP CPU shared event generator register</description>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CSEVT</name>
              <description>CSEVT[21:0] bits (CPU Shared Software Event )</description>
              <bitOffset>1</bitOffset>
              <bitWidth>22</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CDEGR</name>
          <description>HSP CPU dedicated event generation register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CTSKN</name>
              <description>CTSKN[5:0] bits (CPU Task number)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CDEGBSY</name>
              <description>CDEGBSY (CPU dedicated event generator busy)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGINSELR0</name>
          <description>HSP TRGIN input selection register 0</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRG0SEL</name>
              <description>TRG0SEL[5:0] bits (Input trigger selection for TRGIN0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TRG1SEL</name>
              <description>TRG1SEL[5:0] bits (Input trigger selection for TRGIN1)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TRG2SEL</name>
              <description>TRG2SEL[5:0] bits (Input trigger selection for TRGIN2)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TRG3SEL</name>
              <description>TRG3SEL[5:0] bits (Input trigger selection for TRGIN3)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGINSELR1</name>
          <description>HSP TRGIN input selection register 1</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRG4SEL</name>
              <description>TRG4SEL[5:0] bits (Input trigger selection for TRGIN4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TRG5SEL</name>
              <description>TRG5SEL[5:0] bits (Input trigger selection for TRGIN5)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TRG6SEL</name>
              <description>TRG6SEL[5:0] bits (Input trigger selection for TRGIN6)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TRG7SEL</name>
              <description>TRG7SEL[5:0] bits (Input trigger selection for TRGIN7)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGINSELR2</name>
          <description>HSP TRGIN input selection register 2</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRG8SEL</name>
              <description>TRG8SEL[5:0] bits (Input trigger selection for TRGIN8)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TRG9SEL</name>
              <description>TRG9SEL[5:0] bits (Input trigger selection for TRGIN9)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKOCFGR0</name>
          <description>HSP break output configuration register 0-3</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACCEREN</name>
              <description>ACCEREN (Access error break enable for ACCERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FPUEREN</name>
              <description>FPUEREN (FPU error break enable for FPUERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPCEREN</name>
              <description>OPCEREN (Opcode error break enable for OPCOERRF )</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT28EN</name>
              <description>PFCT28EN (Processing function flag break enable for PFCTF[28] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT29EN</name>
              <description>PFCT29EN (Processing function flag break enable for PFCTF[29] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT30EN</name>
              <description>PFCT30EN (Processing function flag break enable for PFCTF[30] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT31EN</name>
              <description>PFCT31EN (Processing function flag break enable for PFCTF[31] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWEREN</name>
              <description>FWEREN (Firmware error break enable for FWERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDEGOVEN</name>
              <description>HDEGOVEN (HSP dedicated event generator overrun break enable for HDEGOVRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKOCFGR1</name>
          <description>HSP break output configuration register 0-3</description>
          <addressOffset>0x16c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACCEREN</name>
              <description>ACCEREN (Access error break enable for ACCERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FPUEREN</name>
              <description>FPUEREN (FPU error break enable for FPUERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPCEREN</name>
              <description>OPCEREN (Opcode error break enable for OPCOERRF )</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT28EN</name>
              <description>PFCT28EN (Processing function flag break enable for PFCTF[28] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT29EN</name>
              <description>PFCT29EN (Processing function flag break enable for PFCTF[29] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT30EN</name>
              <description>PFCT30EN (Processing function flag break enable for PFCTF[30] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCT31EN</name>
              <description>PFCT31EN (Processing function flag break enable for PFCTF[31] &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWEREN</name>
              <description>FWEREN (Firmware error break enable for FWERRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDEGOVEN</name>
              <description>HDEGOVEN (HSP dedicated event generator overrun break enable for HDEGOVRF &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
