modm-ext/data.modm.io/docs/svd/header_stm32u3b5xx.svd
        <register>
          <name>CAPDR</name>
          <description>HSP data capture register</description>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSTAMP</name>
              <description>Time-stamp value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>IFHIST</name>
              <description>IF condition history</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IFCNT</name>
              <description>IF instruction counter</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TSKNB</name>
              <description>Last captured task number</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPDR_ALT</name>
          <description>HSP data capture register</description>
          <alternateRegister>CAPDR</alternateRegister>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ALT_IFHIST</name>
              <description>IF condition history</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>IFCNT</name>
              <description>IF instruction counter</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TSKNB</name>
              <description>Last captured task number</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPCR</name>
          <description>HSP capture control register</description>
          <addressOffset>0x384</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAPMOD</name>
              <description>CAPMOD[1:0] bits (Capture mode )</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FRCNTEN</name>
              <description>FRCNTEN (Free-running counter enable )</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRESC</name>
              <description>PRESC[4:0] bits (Time-stamp prescaler value )</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TSKFLT</name>
              <description>TSKFLT (Task filter enable &lt;sup&gt;(1)&lt;/sup&gt;)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCNTREN</name>
              <description>CCNTREN (Conflict counter enable )</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_IER</name>
          <description>HSP error interrupt enable register</description>
          <addressOffset>0x398</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRGIOVRIE</name>
              <description>TRGIOVRIE (TRGITF overrun interrupt enable)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B0ERRIE</name>
              <description>B0ERRIE (H2CBUFF0 underrun or C2HBUFF0 overrun interrupt enable)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B1ERRIE</name>
              <description>B1ERRIE (H2CBUFF1 underrun or C2HBUFF1 overrun interrupt enable)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B2ERRIE</name>
              <description>B2ERRIE (H2CBUFF2 underrun or C2HBUFF2 overrun interrupt enable)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B3ERRIE</name>
              <description>B3ERRIE (H2CBUFF3 underrun or C2HBUFF3 overrun interrupt enable)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAPOVRIE</name>
              <description>CAPOVRIE (Capture register overrun interrupt enable)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWERRIE</name>
              <description>FWERRIE (Firmware error interrupt enable)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCHERRIE</name>
              <description>SCHERRIE (Scheduler error interrupt enable)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKINIE</name>
              <description>BKINIE (Break input interrupt enable)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDEGOVRIE</name>
              <description>HDEGOVRIE (SPE event overrun interrupt enable)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPCOERRIE</name>
              <description>OPCOERRIE (Invalid Op. code error interrupt enable)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACCERRIE</name>
              <description>ACCERRIE (SPE access error interrupt enable)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDFIE</name>
              <description>UDFIE (FPU Underflow exception interrupt enable)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVFIE</name>
              <description>OVFIE (FPU Overflow exception interrupt enable)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBZIE</name>
              <description>DBZIE (FPU division-by-zero exception interrupt enable)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVIE</name>
              <description>INVIE (FPU Invalid exception interrupt enable)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DENORMIE</name>
              <description>DENORMIE (FPU denormal interrupt enable)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_IER</name>
          <description>HSP events interrupt enable register</description>
          <addressOffset>0x39c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>H2CMRDYIE</name>
              <description>H2CMRDYIE (HSP to CPU message ready interrupt enable)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C2HMFREEIE</name>
              <description>C2HMFREEIE (CPU to HSP message box free interrupt enable)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCDONEIE</name>
              <description>DCDONEIE (Direct command done interrupt enable)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAPRDYIE</name>
              <description>CAPRDYIE (Capture buffer data ready interrupt enable)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDEGRDYIE</name>
              <description>CDEGRDYIE (CPU Dedicated event generator ready interrupt enable)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOFWFEIE</name>
              <description>SOFWFEIE (Start of WFE interrupt enable)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOFWFEIE</name>
              <description>EOFWFEIE (End of WFE interrupt enable)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B0EVTIE</name>
              <description>B0EVTIE (BUFF0 event interrupt enable)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B1EVTIE</name>
              <description>B1EVTIE (BUFF1 event interrupt enable)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B2EVTIE</name>
              <description>B2EVTIE (BUFF2 event interrupt enable)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B3EVTIE</name>
              <description>B3EVTIE (BUFF3 event interrupt enable)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOTECP0IE</name>
              <description>SOTECP0IE (Start of task generated by event comparator 0 interrupt enable)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOTECP1IE</name>
              <description>SOTECP1IE (Start of task generated by event comparator 1 interrupt enable)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOTECP2IE</name>
              <description>SOTECP2IE (Start of task generated by event comparator 2 interrupt enable)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOTECP3IE</name>
              <description>SOTECP3IE (Start of task generated by event comparator 3 interrupt enable)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOTECP0IE</name>
              <description>EOTECP0IE (End of task generated by event comparator 0 interrupt enable)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOTECP1IE</name>
              <description>EOTECP1IE (End of task generated by event comparator 1 interrupt enable)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOTECP2IE</name>
              <description>EOTECP2IE (End of task generated by event comparator 2 interrupt enable)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOTECP3IE</name>
              <description>EOTECP3IE (End of task generated by event comparator 3 interrupt enable)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOVLPIE</name>
              <description>TOVLPIE (Task overlap flag interrupt enable)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FPUSATIE</name>
              <description>FPUSATIE (Saturation flag interrupt enable)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PFCTEVT_IER</name>
          <description>HSP processing event interrupt enable register</description>
          <addressOffset>0x3a0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PFCTIE</name>
              <description>PFCTIE[31:0] bits (Processing function flags interrupt enable)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_ISR</name>
          <description>HSP error interrupt status register</description>
          <addressOffset>0x3a4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRGIOVRF</name>
              <description>TRGIOVRF (TRGITF overrun flag)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B0ERRF</name>
              <description>B0ERRF (H2CBUFF0 underrun or C2HBUFF0 overrun flag)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B1ERRF</name>
              <description>B1ERRF (H2CBUFF1 underrun or C2HBUFF1 overrun flag)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B2ERRF</name>
              <description>B2ERRF (H2CBUFF2 underrun or C2HBUFF2 overrun flag)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B3ERRF</name>
              <description>B3ERRF (H2CBUFF3 underrun or C2HBUFF3 overrun flag)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAPOVRF</name>
              <description>CAPOVRF (Capture register overrun flag)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWERRF</name>
              <description>FWERRF (Firmware error flag)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCHERRF</name>
              <description>SCHERRF (Scheduler error flag)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKINF</name>
              <description>BKINF (Break input flag)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDEGOVRF</name>
              <description>HDEGOVRF (SPE event overrun flag)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPCOERRF</name>
              <description>OPCOERRF (Invalid OpCode error flag)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACCERRF</name>
              <description>ACCERRF (SPE Access error flag)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FPUERRF</name>
              <description>FPUERRF (Computation error flag)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_ISR</name>
          <description>HSP events interrupt status register</description>
          <addressOffset>0x3a8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>H2CMRDYF</name>
              <description>H2CMRDYF (HSP to CPU message ready flag)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C2HMFREEF</name>
              <description>C2HMFREEF (CPU to HSP message box free flag)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCDONEF</name>
              <description>DCDONEF (Direct command done flag)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAPRDYF</name>
              <description>CAPRDYF (Capture buffer data ready flag)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDEGRDYF</name>
              <description>CDEGRDYF (CPU Dedicated event generator ready flag)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOFWFEF</name>
              <description>SOFWFEF (Start of WFE flag)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOFWFEF</name>
              <description>EOFWFEF (End of WFE flag)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B0EVTF</name>
              <description>B0EVTF (BUFF0 event flag)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B1EVTF</name>
              <description>B1EVTF (BUFF1 event flag)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B2EVTF</name>
              <description>B2EVTF (BUFF2 event flag)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B3EVTF</name>
              <description>B3EVTF (BUFF3 event flag)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOTECP0F</name>
              <description>SOTECP0F (Start of task flag, for event comparator 0)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOTECP1F</name>
              <description>SOTECP1F (Start of task flag, for event comparator 1)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOTECP2F</name>
              <description>SOTECP2F (Start of task flag, for event comparator 2)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOTECP3F</name>
              <description>SOTECP3F (Start of task flag, for event comparator 3)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOTECP0F</name>
              <description>EOTECP0F (End of task flag, for event comparator 0)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOTECP1F</name>
              <description>EOTECP1F (End of task flag, for event comparator 1)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOTECP2F</name>
              <description>EOTECP2F (End of task flag, for event comparator 2)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOTECP3F</name>
              <description>EOTECP3F (End of task flag, for event comparator 3)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOVLPF</name>
              <description>TOVLPF (Task overlap flag)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FPUSATF</name>
              <description>FPUSATF (FPU saturation flag)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PFCTEVT_ISR</name>
          <description>HSP processing event interrupt status register</description>
          <addressOffset>0x3ac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PFCTF</name>
              <description>PFCTF[31:0] bits (Flags generated by SPE processing functions )</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
